-- phpMyAdmin SQL Dump
-- version 3.5.5
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 13 2017 г., 17:56
-- Версия сервера: 5.1.67-community-log
-- Версия PHP: 5.2.17

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `simpleforum`
--
CREATE DATABASE `simpleforum` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `simpleforum`;

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE IF NOT EXISTS `categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `parent` int(11) DEFAULT NULL,
  `categories_counter_topics` int(11) NOT NULL,
  `categories_counter_messages` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=9 ;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `parent`, `categories_counter_topics`, `categories_counter_messages`) VALUES
(1, 'Раздел новостей', NULL, 4, 0),
(2, 'Оффтопик', NULL, 1, 57),
(3, 'Новости в мире', 1, 6, 4),
(4, 'Новости в России', 1, 0, 1),
(5, 'Рисунки', 2, 1, 105),
(6, 'Музыка', 2, 0, 1),
(7, 'Общение', 2, 0, 0),
(8, 'Игры', 2, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE IF NOT EXISTS `messages` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `tid` int(11) NOT NULL,
  `message` longtext NOT NULL,
  `date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=101 ;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`id`, `uid`, `tid`, `message`, `date`) VALUES
(1, 1, 1, 'Пример сообщения один.', '2017-03-31 00:56:48'),
(2, 1, 1, 'Пример сообщения два.', '2017-03-31 00:56:53'),
(16, 1, 15, 'Привет', '2017-04-11 21:53:20'),
(17, 1, 16, 'Привет', '2017-04-11 21:56:56'),
(18, 1, 17, 're', '2017-04-11 21:57:07'),
(19, 1, 18, 'ghbdtn', '2017-04-11 21:59:19'),
(20, 1, 19, 'ghbdtn', '2017-04-11 21:59:32'),
(21, 1, 20, 'он говно', '2017-04-11 22:10:40'),
(22, 1, 21, 'дж', '2017-04-11 22:11:24'),
(23, 1, 22, 'ку', '2017-04-11 22:13:13'),
(24, 1, 23, 'qweqwe', '2017-04-11 22:13:36'),
(25, 1, 24, '123123', '2017-04-11 22:14:10'),
(26, 1, 25, '123123', '2017-04-11 22:14:54'),
(27, 1, 26, 'askdlfjasd', '2017-04-11 22:32:10'),
(28, 1, 27, 'askdlfjasd', '2017-04-11 22:32:54'),
(29, 1, 28, 'askdlfjasd', '2017-04-11 22:33:05'),
(30, 1, 29, 'asdasd', '2017-04-11 22:33:10'),
(31, 1, 30, 'asdasdasdasd', '2017-04-11 22:33:23'),
(32, 1, 31, 'ПАривет', '2017-04-12 20:51:05'),
(33, 1, 1, 're', '2017-04-12 20:56:55'),
(34, 1, 1, 'asdasdasd', '2017-04-12 21:37:23'),
(35, 1, 20, 'Да', '2017-04-12 21:38:40'),
(36, 4, 21, '123123123', '2017-04-12 21:42:34'),
(37, 4, 21, 'ну да найс рофлан ебало', '2017-04-13 01:00:10'),
(38, 4, 32, 'tr', '2017-04-13 01:08:10'),
(39, 1, 33, 're', '2017-04-13 15:19:24'),
(40, 1, 34, '123', '2017-04-13 15:19:34'),
(41, 1, 35, '123123', '2017-04-13 15:21:36'),
(42, 1, 36, '123123', '2017-04-13 15:47:51'),
(43, 1, 36, '123', '2017-04-13 15:47:53'),
(44, 1, 36, '123', '2017-04-13 15:47:55'),
(45, 1, 36, '123', '2017-04-13 15:47:55'),
(46, 1, 36, '123', '2017-04-13 15:47:56'),
(47, 1, 36, '123', '2017-04-13 15:47:56'),
(48, 1, 36, '123', '2017-04-13 15:47:56'),
(49, 1, 36, '123', '2017-04-13 15:47:57'),
(50, 1, 36, '123', '2017-04-13 15:47:57'),
(51, 1, 36, '123', '2017-04-13 15:47:57'),
(52, 1, 36, '123', '2017-04-13 15:47:57'),
(53, 1, 36, '123', '2017-04-13 15:47:58'),
(54, 1, 36, '123', '2017-04-13 15:47:58'),
(55, 1, 36, '123', '2017-04-13 15:47:58'),
(56, 1, 36, '123', '2017-04-13 15:47:58'),
(57, 1, 36, '123', '2017-04-13 15:47:59'),
(58, 1, 36, '123', '2017-04-13 15:47:59'),
(59, 1, 36, '123', '2017-04-13 15:47:59'),
(60, 1, 36, '123', '2017-04-13 15:47:59'),
(61, 1, 36, '123', '2017-04-13 15:48:00'),
(62, 1, 36, '123', '2017-04-13 15:48:00'),
(63, 1, 36, '123', '2017-04-13 15:48:00'),
(64, 1, 36, '123', '2017-04-13 15:48:00'),
(65, 1, 36, '123', '2017-04-13 15:48:01'),
(66, 1, 36, '123', '2017-04-13 15:48:01'),
(67, 1, 36, '123', '2017-04-13 15:48:01'),
(68, 1, 36, '123', '2017-04-13 15:48:01'),
(69, 1, 36, '123', '2017-04-13 15:48:01'),
(70, 1, 36, '123', '2017-04-13 15:48:02'),
(71, 1, 36, '123', '2017-04-13 15:48:02'),
(72, 1, 36, '123', '2017-04-13 15:48:02'),
(73, 1, 36, '123', '2017-04-13 15:48:02'),
(74, 1, 36, '123', '2017-04-13 15:48:03'),
(75, 1, 36, '123', '2017-04-13 15:48:03'),
(76, 1, 36, '123', '2017-04-13 15:48:03'),
(77, 1, 36, '123', '2017-04-13 15:48:04'),
(78, 1, 36, '123', '2017-04-13 15:48:04'),
(79, 1, 36, '123', '2017-04-13 15:48:04'),
(80, 1, 36, '123', '2017-04-13 15:48:04'),
(81, 1, 36, '123', '2017-04-13 15:48:04'),
(82, 1, 36, '123', '2017-04-13 15:48:05'),
(83, 1, 36, '123', '2017-04-13 15:48:05'),
(84, 1, 36, '123', '2017-04-13 15:48:05'),
(85, 1, 36, '123', '2017-04-13 15:48:05'),
(86, 1, 36, '123', '2017-04-13 15:48:06'),
(87, 1, 36, '123', '2017-04-13 15:48:06'),
(88, 1, 36, '123', '2017-04-13 15:48:06'),
(89, 1, 36, '123', '2017-04-13 15:48:07'),
(90, 1, 18, '123123', '2017-04-13 15:50:25'),
(91, 1, 18, '123123', '2017-04-13 15:50:27'),
(92, 1, 18, '123123', '2017-04-13 15:50:27'),
(93, 1, 18, '123123', '2017-04-13 15:50:27'),
(94, 1, 18, '123123', '2017-04-13 15:50:27'),
(95, 1, 18, '123123', '2017-04-13 15:50:28'),
(96, 1, 18, '123123', '2017-04-13 15:50:28'),
(97, 1, 18, '123', '2017-04-13 15:50:34'),
(98, 1, 37, '123', '2017-04-13 15:53:16'),
(99, 1, 36, 'Всем привет!', '2017-04-13 16:19:31'),
(100, 1, 36, 'Привет', '2017-04-13 16:22:12');

-- --------------------------------------------------------

--
-- Структура таблицы `topics`
--

CREATE TABLE IF NOT EXISTS `topics` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `parent` int(11) NOT NULL,
  `counter_messages` int(11) NOT NULL,
  `counter_view` int(11) NOT NULL,
  `last_message_id` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=38 ;

--
-- Дамп данных таблицы `topics`
--

INSERT INTO `topics` (`id`, `title`, `parent`, `counter_messages`, `counter_view`, `last_message_id`) VALUES
(1, 'Пример топика', 7, 3, 136, 2),
(15, 'Пример 2', 7, 1, 0, 0),
(16, 'Пример 2', 7, 1, 0, 0),
(17, 're', 7, 1, 0, 0),
(18, 'ghbdtn', 5, 9, 13, 0),
(19, 'ghbdtn', 5, 1, 1, 0),
(20, 'русский реп говно', 6, 2, 2, 0),
(21, 'говно ведь', 6, 3, 22, 0),
(22, 'ку', 6, 1, 1, 0),
(23, 'qweqwe', 6, 1, 0, 0),
(24, '123123', 6, 1, 0, 0),
(25, '123123', 6, 1, 0, 0),
(26, 'Ghbdtn', 6, 1, 0, 0),
(27, 'Ghbdtn', 6, 1, 0, 0),
(28, 'Ghbdtn', 6, 1, 0, 0),
(29, 'sadasd', 6, 1, 0, 0),
(30, 'aasdasdasd', 6, 1, 0, 0),
(31, 'ПРивет', 6, 1, 1, 0),
(32, 'tr', 4, 1, 1, 0),
(33, 're', 3, 1, 4, 0),
(34, '123', 3, 1, 1, 0),
(35, '123123', 3, 1, 1, 0),
(36, 'Тест страничек', 5, 50, 144, 0),
(37, '123', 3, 1, 1, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(255) NOT NULL,
  `password` varchar(32) NOT NULL,
  `email` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `email`) VALUES
(1, 'Ravsii', '95e1f425070482d6f97e8d062eac44cc', 'naplle58@gmail.com'),
(2, 'Ravsii1', '4297f44b13955235245b2497399d7a93', 'naplle158@gmail.com'),
(3, '123123', '4297f44b13955235245b2497399d7a93', 'nap345lle58@gmail.com'),
(4, 'test', 'f5bb0c8de146c67b44babbf4e6584cc0', 'te2st@test.ru');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
