<div class="background_message_user">
    <div class="user_panel">
        <span id="name">Имя пользователя</span>
        <div class="user_avatar"></div>
        <span id="count_messages">Сообщений: 1000</span>
        <span id="status">Статус: Online</span>
    </div>
    <span id="date_text">Опубликовано - 15/03/2017</span>
    <div class="text_messages">
        Слой, создаваемый через тег является блочным элементом веб-страницы. Это означает, что по ширине слой занимает
        все доступное пространство и всегда начинается с новой строки. Поэтому ограничение ширины слоев никак не
        приведет к тому, что блоки станут располагаться рядом. Для нашей цели следует воспользоваться стилевым свойством
        float со значением left. Это свойство превращает блочный элемент в плавающий, что в свою очередь приводит к
        выравниванию слоя по левому краю и его обтеканию другими элементами по правому краю. На деле же слои при
        подобной манипуляции выстраиваются не друг под другом как обычно, а рядом по горизонтали. Но только в том
        случае, когда ширина слоев задана через свойство width, как показано в примере 1.
        Слой, создаваемый через тег является блочным элементом веб-страницы. Это означает, что по ширине слой занимает
        все доступное пространство и всегда начинается с новой строки. Поэтому ограничение ширины слоев никак не
        приведет к тому, что блоки станут располагаться рядом. Для нашей цели следует воспользоваться стилевым свойством
        float со значением left. Это свойство превращает блочный элемент в плавающий, что в свою очередь приводит к
        выравниванию слоя по левому краю и его обтеканию другими элементами по правому краю. На деле же слои при
        подобной манипуляции выстраиваются не друг под другом как обычно, а рядом по горизонтали. Но только в том
        случае, когда ширина слоев задана через свойство width, как показано в примере 1.
    </div>
    <div class="clear"></div>
</div>